/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "无效值。";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "值“%@”无效。";

/* NSFormattingError */
"Err2048-C" = "格式化错误。";

/* NSFileLockingError */
"Err255-C" = "未能锁定该文件。";

/* NSFileLockingError */
"Err255-R" = "可能已锁定该文件，或您没有相应的访问权限来锁定它。";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "未能锁定文件“%@”。";

/* NSFileReadUnknownError */
"Err256" = "未能打开文件。";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "未能打开文件“%@”。";

/* NSFileReadNoPermissionError */
"Err257" = "不能打开该文件，因为您没有相应的访问权限。";

/* NSFileReadNoPermissionError */
"Err257-C" = "您没有相应的访问权限。";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "要查看或更改访问权限，请在 Finder 中选择项，然后选取“文件”>“显示简介”。";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "不能打开文件“%@”，因为您没有相应的访问权限。";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "无效的文件名称。";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "未能打开该项，因为文件名称“%@”无效。";

/* NSFileReadCorruptFileError */
"Err259" = "不能打开该文件，因为它的格式不正确。";

/* NSFileReadCorruptFileError */
"Err259-C" = "该文件的格式不正确。";

/* NSFileReadCorruptFileError */
"Err259-R" = "该文件可能已损坏、截掉，或格式与期望的不一样。";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "未能打开文件“%@”，因为它的格式不正确。";

/* NSFileReadNoSuchFileError */
"Err260-C" = "该文件不存在。";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "文件“%@”不存在。";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "未能使用指定的文本编码打开该文件。";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "指定的文本编码不适用。";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "文本编码“%@”不适用。";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "该文件可能已使用了不同的文本编码来存储，或者可能不是文本文件。";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "未能使用文本编码 %@ 打开该文件。";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "未能使用文本编码 %1$@ 打开文件“%2$@”。";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "不能打开该文件，因为不支持指定的 URL 类型。";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "不支持指定的 URL 类型。";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "未能打开文件“%1$@”，因为 URL 类型 %2$@ 不被支持。";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "不能打开该文件，因为不支持 URL 类型 %@。";

/* NSFileReadTooLargeError */
"Err263" = "不能打开该文件，因为文件太大。";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "文件太大。";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "未能打开文件“%@”，因为它太大。";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "未能打开该文件，因为无法确定其内容的文本编码。";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "未能确定该内容的文本编码。";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "要打开该文件，可能需要明确指定一种文本编码。";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "未能打开文件“%@”，因为无法确定其内容的文本编码。";

/* NSUserCancelledError */
"Err3072-C" = "操作已被取消。";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "未能删除“%@”。";

/* NSFileNoSuchFileError */
"Err4-C" = "该文件不存在。";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "文件“%@”不存在。";

/* NSFileWriteUnknownError */
"Err512" = "未能存储该文件。";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "未能将“%1$@”拷贝到“%2$@”。";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "未能将“%1$@”链接到“%2$@”。";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "未能将“%1$@”移到“%2$@”。";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "未能删除“%@”。";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "未能将文件“%2$@”存储在文件夹“%1$@”中。";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "未能存储文件“%@”。";

/* NSFileWriteNoPermissionError */
"Err513" = "不能存储该文件，因为您没有相应的访问权限。";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "未能拷贝“%1$@”，因为您没有访问“%2$@”的适当权限。";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "未能链接“%1$@”，因为您没有访问“%2$@”的适当权限。";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "未能移动“%1$@”，因为您没有访问“%2$@”的适当权限。";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "未能删除“%@”，因为您没有适当的访问权限。";

/* NSFileWriteNoPermissionError */
"Err513-C" = "您没有相应的访问权限。";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "要查看或更改访问权限，请在 Finder 中选择项，然后选取“文件”>“显示简介”。";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "您没有相应的访问权限将文件“%2$@”存储在文件夹“%1$@”中。";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "您没有相应的访问权限来存储文件“%@”。";

/* NSFileWriteInvalidFileNameError */
"Err514" = "未能存储该项，因为文件名称无效。";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "未能删除该项，因为文件名称“%@”无效。";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "无效的文件名称。";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "未能存储该项，因为文件名称“%@”无效。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "未能使用指定的文本编码存储该文件。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "指定的文本编码不适用。";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "文本编码“%@”不适用。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "如果可能，请选择另一种文本编码。";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "未能使用文本编码 %@ 存储该文件。";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "未能使用文本编码 %1$@ 存储文件“%2$@”。";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "不能存储该文件，因为不支持指定的 URL 类型。";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "不支持指定的 URL 类型。";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "未能存储文件“%1$@”，因为 URL 类型 %2$@ 不被支持。";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "不能存储该文件，因为不支持 URL 类型 %@。";

/* NSFileWriteOutOfSpaceError */
"Err640" = "未能存储该文件，因为空间不足。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "未能将“%1$@”拷贝到“%2$@”，因为没有足够的空间。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "未能将“%1$@”链接到“%2$@”，因为没有足够的空间。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "未能将“%1$@”移到“%2$@”，因为没有足够的空间。";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "空间不足。";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "宗卷“%@”空间不足。";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "请从该宗卷移去一些文件后重试。";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "您不能存储文件“%@”，因为空间不足。";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "您不能存储文件“%1$@”，因为宗卷“%2$@”空间不足。";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "未能完成操作。（%1$@ 错误 %2$ld。）";

